package dz3;

public class MainClassDz3 {
    public static void String (String[] args){
        ex1();
        ex2();



    }

    private static void ex1() {
        /*1. Создать список типа ArrayList<String>.
        Поместить в него как строки, так и целые числа.
                Пройти по списку, найти и удалить целые числа.
        Пример: {"Яблоко", "11", "13", "Апельсин", "Дыня", "17"} -> {"Яблоко", "Апельсин", "Дыня"}*/

    }

    private static void ex2() {
        /*2. Каталог товаров книжного магазина сохранен в виде двумерного списка List<ArrayList<String>> так,
         что на нулевой позиции каждого внутреннего списка содержится название жанра, а на остальных позициях - названия книг.
         Напишите метод для заполнения данной структуры(можно через консоль).

        Пример:
        "Классика", "Преступление и наказание", "Война и мир", "Анна Каренина".
        "Научная фантастика", "Солярис", "Ночной дозор", "Братья Стругацкие".
        "Детектив", "Десять негритят".
        "Фантастика", "Хроники Нарнии", "Гарри Поттер и философский камень", "Грозовой перевал".*/
    }
}
